# FailedToPlaceCapWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures..::..FailedToPlaceCapWarning Property
BuiltInFailures..::..GenericMEPFailures Class See Also
---
Failed to place cap on the open connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToPlaceCapWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToPlaceCapWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToPlaceCapWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericMEPFailures Class
Autodesk.Revit.DB Namespace